## Day 19: Runners Data Analysis â€“ Part 2

In [1]:
names = ["Joe", "Phil", "Ken", "Jos", "Luke"]
miles_run = [120, 80, 100, 90, 85]
time_in_hrs = [40, 38, 45, 50, 50]

1. Create a DataFrame from the lists above using pandas

In [4]:
import pandas as pd

df = pd.DataFrame({"Names": names, "Miles run": miles_run, "Time in hrs":time_in_hrs})
df

  Names  Miles run  Time in hrs
0   Joe        120           40
1  Phil         80           38
2   Ken        100           45
3   Jos         90           50
4  Luke         85           50

2. More information has become available below. Create a 
new DataFrame with this information. Merge it to the 
DataFrame above using pandas concat() function.

In [5]:
# New information
names = ["Joe", "Phil", "Ken", "Jos", "Luke"]
Age = [45, 28, 21, 55, 62]
gender = ["M", "M", "F", "F", "M"]

In [6]:
df_new = pd.DataFrame({"Names": names, "Age": Age, "gender": gender})
df_new

  Names  Age gender
0   Joe   45      M
1  Phil   28      M
2   Ken   21      F
3   Jos   55      F
4  Luke   62      M

In [7]:
df = pd.concat([df, df_new.drop(columns="Names")], axis=1)
df

  Names  Miles run  Time in hrs  Age gender
0   Joe        120           40   45      M
1  Phil         80           38   28      M
2   Ken        100           45   21      F
3   Jos         90           50   55      F
4  Luke         85           50   62      M

3. Shuffling DataFrames can randomize the data. Write code 
to reshuffle the index of the DataFrame.

In [9]:
# Reshuffling the dataset
df = df.sample(frac=1)
df

  Names  Miles run  Time in hrs  Age gender
2   Ken        100           45   21      F
0   Joe        120           40   45      M
4  Luke         85           50   62      M
1  Phil         80           38   28      M
3   Jos         90           50   55      F

4. Explain why it may be important to reshuffle the index of 
the data for machine learning. 

Reshuffling the index of data is important in machine learning because it helps prevent order bias and ensures that models learn general patterns rather than memorizing the sequence of the data. reshuffling helps maintain the integrity of the learning process by ensuring randomness and reducing bias.

5. Using the pandas melt() function, reshape your DataFrame 
to a long format. The "names" column must remain in 
place.

In [10]:
def_set_long = df.melt(id_vars=["Names"],
                       var_name="Variable",
                       value_name="Values")

def_set_long

   Names     Variable Values
0    Ken    Miles run    100
1    Joe    Miles run    120
2   Luke    Miles run     85
3   Phil    Miles run     80
4    Jos    Miles run     90
5    Ken  Time in hrs     45
6    Joe  Time in hrs     40
7   Luke  Time in hrs     50
8   Phil  Time in hrs     38
9    Jos  Time in hrs     50
10   Ken          Age     21
11   Joe          Age     45
12  Luke          Age     62
13  Phil          Age     28
14   Jos          Age     55
15   Ken       gender      F
16   Joe       gender      M
17  Luke       gender      M
18  Phil       gender      M
19   Jos       gender      F